Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеестрДокументов</name>
  <resources>
    <name>НомерДокументаИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПеремещенийТоваров</types>
      <types>EnumRef.СтатусыАктаОРасхождениях</types>
      <types>EnumRef.СтатусыСборокТоваров</types>
      <types>EnumRef.СтатусыПередачМатериаловВПроизводство</types>
      <types>EnumRef.СтатусыЗаявокНаВозвратТоваровОтКлиентов</types>
      <types>EnumRef.СтатусыАвансовогоОтчета</types>
      <types>EnumRef.СтатусыОтраженияДокументовВРеглУчете</types>
      <types>EnumRef.СтатусыТаможенныхДеклараций</types>
      <types>EnumRef.СтатусыЗаказовКлиентов</types>
      <types>EnumRef.СтатусыЗаказовНаРемонт</types>
      <types>EnumRef.СтатусыДвиженияПродукцииИМатериалов</types>
      <types>EnumRef.СтатусыВозвратовМатериаловИзПроизводства</types>
      <types>EnumRef.СтатусыЗаказовПоставщикам</types>
      <types>EnumRef.СтатусыЗаказовМатериаловВПроизводство</types>
      <types>EnumRef.СтатусыРеализацийТоваровУслуг</types>
      <types>EnumRef.СтатусыВнутреннихЗаказов</types>
      <types>EnumRef.СтатусыЗаказовПереработчикам</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Дополнительно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПервичногоДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НомерПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
      <types>CatalogRef.ДоговорыЛизинга</types>
    </type>
  </resources>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтраженияВУчете</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипСсылки</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.КлючиРеестраДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.КлючиРеестраДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <comment>Подразделение, оформившее документ</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДокументаИБ</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.ПодготовкаКПередачеНМА</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.АктОРасхожденияхПослеПеремещения</types>
      <types>DocumentRef.ПеремещениеВЭксплуатации</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.АктОРасхожденияхПослеОтгрузки</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПереоценкаНМА2_4</types>
      <types>DocumentRef.ПередачаОСАрендатору</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
      <types>DocumentRef.СчетФактураПолученныйАванс</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ПриобретениеУслугПоЛизингу</types>
      <types>DocumentRef.ИнойДокументПодтвержденияНДС</types>
      <types>DocumentRef.РегистрацияЗемельныхУчастков</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПодготовкаКПередачеНМА2_4</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.АмортизацияНМА</types>
      <types>DocumentRef.ВнесениеДенежныхСредствВКассуККМ</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеОС2_4</types>
      <types>DocumentRef.ОтгрузкаТоваровСХранения</types>
      <types>DocumentRef.ИзменениеПараметровОС2_4</types>
      <types>DocumentRef.РаспределениеПроизводственныхЗатрат</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.АктОРасхожденияхПослеПриемки</types>
      <types>DocumentRef.СчетФактураНаНеподтвержденнуюРеализацию0</types>
      <types>DocumentRef.НаработкаТМЦВЭксплуатации</types>
      <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
      <types>DocumentRef.ВозвратОСОтАрендатора2_4</types>
      <types>DocumentRef.ОперацияПоЯндексКассе</types>
      <types>DocumentRef.АктВыполненныхВнутреннихРабот</types>
      <types>DocumentRef.ВыработкаСотрудников</types>
      <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
      <types>DocumentRef.ИнвентаризационнаяОпись</types>
      <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
      <types>DocumentRef.СчетФактураВыданныйАванс</types>
      <types>DocumentRef.ЗаказПереработчику</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.СводнаяСправкаНДС</types>
      <types>DocumentRef.ПеремещениеОС2_4</types>
      <types>DocumentRef.РазукомплектацияОС</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.МодернизацияОС2_4</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
      <types>DocumentRef.ПоступлениеТоваровОтХранителя</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ПодготовкаКПередачеОС2_4</types>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
      <types>DocumentRef.ИзменениеПараметровНМА</types>
      <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ПереоценкаОС2_4</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
      <types>DocumentRef.АмортизацияОС</types>
      <types>DocumentRef.ОтчетОператораСистемыПлатон</types>
      <types>DocumentRef.НаработкаОбъектовЭксплуатации</types>
      <types>DocumentRef.ПодготовкаКПередачеОС</types>
      <types>DocumentRef.ТаможеннаяДекларацияЭкспорт</types>
      <types>DocumentRef.ПоступлениеАрендованныхОС</types>
      <types>DocumentRef.ВводОстатковВнеоборотныхАктивов2_4</types>
      <types>DocumentRef.ПереоценкаНМА</types>
      <types>DocumentRef.ПередачаСырьяПереработчику</types>
      <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
      <types>DocumentRef.ВводОстатковВнеоборотныхАктивов</types>
      <types>DocumentRef.КорректировкаЗадолженностиПоФинансовымИнструментам</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
      <types>DocumentRef.ПоступлениеДенежныхДокументов</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПринятиеКУчетуНМА2_4</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ИзменениеСпособаОтраженияИмущественныхНалогов</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ПереоценкаОС</types>
      <types>DocumentRef.ПеремещениеНМА2_4</types>
      <types>DocumentRef.ВыработкаНМА</types>
      <types>DocumentRef.АмортизацияНМА2_4</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ИзменениеСостоянияОС</types>
      <types>DocumentRef.СписаниеНМА2_4</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.РаспределениеВозвратныхОтходов</types>
      <types>DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</types>
      <types>DocumentRef.ПринятиеКУчетуОС2_4</types>
      <types>DocumentRef.ИзменениеПараметровОС</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.ВозвратСырьяОтПереработчика</types>
      <types>DocumentRef.ОтменаРегистрацииТранспортныхСредств</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.СписаниеПринятыхНаХранениеТоваров</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ПриемкаТоваровНаХранение</types>
      <types>DocumentRef.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество</types>
      <types>DocumentRef.СписаниеТоваровУХранителя</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
      <types>DocumentRef.ИсправлениеРазвернутогоСальдоТоваровОрганизаций</types>
      <types>DocumentRef.АмортизацияОС2_4</types>
      <types>DocumentRef.ВозвратМатериаловИзПроизводства</types>
      <types>DocumentRef.СчетФактураКомиссионеру</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ИзменениеПараметровНМА2_4</types>
      <types>DocumentRef.ВозвратОСОтАрендатора</types>
      <types>DocumentRef.ИнвентаризацияОС</types>
      <types>DocumentRef.ОтменаРегистрацииЗемельныхУчастков</types>
      <types>DocumentRef.СписаниеИзЭксплуатации</types>
      <types>DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.НачисленияКредитовИДепозитов</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВыкупТоваровХранителем</types>
      <types>DocumentRef.ПередачаОСАрендатору2_4</types>
      <types>DocumentRef.ПередачаМатериаловВПроизводство</types>
      <types>DocumentRef.ПринятиеКУчетуНМА</types>
      <types>DocumentRef.ИнвентаризацияНМА</types>
      <types>DocumentRef.СчетФактураПолученныйНалоговыйАгент</types>
      <types>DocumentRef.ПорчаТоваров</types>
      <types>DocumentRef.ПоступлениеОтПереработчика</types>
      <types>DocumentRef.СписаниеНМА</types>
      <types>DocumentRef.ВыбытиеАрендованныхОС</types>
      <types>DocumentRef.СчетФактураНалоговыйАгент</types>
      <types>DocumentRef.ПоступлениеПредметовЛизинга</types>
      <types>DocumentRef.РегистрацияТранспортныхСредств</types>
      <types>DocumentRef.СчетФактураКомитента</types>
      <types>DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделительЗаписи</name>
    <comment>Служебное измерение, предназначенное для укрупнения порции записи данных в регистр</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/CommonForms/ПереоформлениеНакладныхПоРаспоряжениям/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПриСоздании();
	ЗаполнитьРеквизитыФормыПриСоздании();
	
	Если ЗначениеЗаполнено(ХозяйственнаяОперация)
		И ЗакупкиСервер.ХозяйственныеОперацииРаздельнойЗакупкиБезОтборов().Найти(ХозяйственнаяОперация) <> Неопределено Тогда
		Элементы.НадписьИнфо.Заголовок = НСтр("ru = 'По выбранным заказам уже оформлены накладные. Необходимо скорректировать имеющиеся накладные с учетом поступления командой ""Перезаполнить выбранную"" или оформить новую накладную на оставшиеся неоформленными товары командой ""Оформить новую"".'");
		Элементы.ТоварыНакладной.Заголовок = НСтр("ru = 'Расхождения между накладными и поступлениями'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапки

&НаКлиенте
Процедура НадписьЗаголовокЗаказыНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму(
		"ОбщаяФорма.ПросмотрСпискаДокументов",
		Новый Структура("СписокДокументов, Заголовок",
			СписокЗаказов,
			НСтр("ru='Распоряжения (%КоличествоДокументов%)'")
		),
		ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СтандартныйПериодПриИзменении(Элемент)
	СтандартныйПериодПриИзмененииСервер();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОформленныеНакладные

&НаКлиенте
Процедура ОформленныеНакладныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеНакладная = Элементы.ОформленныеНакладные.ТекущиеДанные;
	ПоказатьЗначение(, ДанныеНакладная.Накладная);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформленныеНакладныеПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ЗаполнитьТаблицуТоварыНакладнойОтложенно", 0.2, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перезаполнить(Команда)
	
	ТекущиеДанные = Элементы.ОформленныеНакладные.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ЗначенияЗаполнения = Новый Структура(
			"ЗаполнятьПоОрдеру, МассивЗаказов, ОтборПоТоварам", Истина, СписокЗаказов.ВыгрузитьЗначения());
		
		Параметры.РеквизитыШапки.Свойство("ОтборПоТоварам", ЗначенияЗаполнения.ОтборПоТоварам);
		
		ПараметрыФормы = Новый Структура(
			"Ключ, ЗначенияЗаполнения", ТекущиеДанные.Накладная, ЗначенияЗаполнения);
		
		ОткрытьФорму(НастройкиФормы.ИмяФормыНакладной, ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьНовую(Команда)
	
	ТекущиеДанные =Элементы.ОформленныеНакладные.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если ТоварыНакладной.Итог("Увеличить") <= 0 Тогда
			
			ТекстПредупреждения = НСтр("ru = 'Нет положительных расхождений. Оформление новой накладной не предусмотрено.'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
			Возврат;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НастройкиФормы.ДанныеЗаполнения) Тогда
			МассивЗаказов = СписокЗаказов.ВыгрузитьЗначения();
			
			// Создание накладной по выделенным заказам.
			ДанныеЗаполнения = Новый Структура("МассивЗаказов, ЗаполнятьПоОрдеру, РеквизитыШапки",
				МассивЗаказов, Истина, Параметры.РеквизитыШапки);
			
			// Специфика передачи параметров для заполнения реализации товаров.
			ВариантОформленияПродажи = ПредопределенноеЗначение("Перечисление.ВариантыОформленияПродажи.РеализацияТоваровУслуг");
			ДанныеЗаполнения.Вставить("ВариантОформленияПродажи", ВариантОформленияПродажи);
			ДанныеЗаполнения.Вставить("ЗаполнятьПоОстаткам",      Истина);
			ДанныеЗаполнения.Вставить("ДокументОснование",        МассивЗаказов);
			ДанныеЗаполнения.Вставить("СкладОтгрузки",            Склад);
			ДанныеЗаполнения.Вставить("СкладПоступления",         Склад);
			ДанныеЗаполнения.Вставить("ПараметрыОформления",      Новый Структура("ПоЗаказам, ПоОрдерам", Ложь, Истина));
		Иначе
			ДанныеЗаполнения = НастройкиФормы.ДанныеЗаполнения;
		КонецЕсли;
		ОткрытьФорму(НастройкиФормы.ИмяФормыНакладной, Новый Структура("Основание", ДанныеЗаполнения));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПриСоздании()
	
	НастройкиФормы = НакладныеСервер.НастройкиФормыПереоформленияНакладных();
	ЗаполнитьЗначенияСвойств(НастройкиФормы, Параметры.НастройкиФормы);
	
	Если НастройкиФормы.Заголовок <> Неопределено Тогда
		Автозаголовок = Ложь;
		Заголовок = НастройкиФормы.Заголовок;
	КонецЕсли;
	
	Заказ = Параметры.Заказы.Получить(0);
	Если Параметры.Заказы.Количество() = 1 Тогда
		Элементы.СтраницыРаспоряжения.ТекущаяСтраница = Элементы.СтраницаЗаказ;
	Иначе
		НадписьЗаголовокЗаказы = НСтр("ru = 'Всего распоряжений'") + ": " + Параметры.Заказы.Количество();
		Элементы.СтраницыРаспоряжения.ТекущаяСтраница = Элементы.СтраницаЗаказы;
	КонецЕсли;
	Элементы.ЗаказТаблица.Видимость = Параметры.Заказы.Количество() > 1;
	Элементы.ОсновнойТовар.Видимость        = НастройкиФормы.ОсновнойТовар.Ключ.Номенклатура <> Неопределено;
	Элементы.ОсновнойТовар.КартинкаШапки    = НастройкиФормы.ОсновнойТовар.КартинкаШапки;
	Элементы.ОсновнойТовар.КартинкаЗначений = НастройкиФормы.ОсновнойТовар.КартинкаЗначений;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыФормыПриСоздании()
	
	Склад = ?(ЗначениеЗаполнено(Параметры.Склад),Параметры.Склад,Параметры.РеквизитыШапки.Склад);
	Склады.ЗагрузитьЗначения(СкладИлиГруппа(Склад));
	Параметры.РеквизитыШапки.Свойство("ХозяйственнаяОперация", ХозяйственнаяОперация);
	СписокЗаказов.ЗагрузитьЗначения(Параметры.Заказы);
	ТаблицаНакладных = НакладныеПоЗаказам(Параметры.Заказы);
	ОформленныеНакладные.Загрузить(ТаблицаНакладных);
	
КонецПроцедуры

&НаСервере
Функция СкладИлиГруппа(Склад)
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ЭтоГруппа") = Истина Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СпрСклады.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Склады КАК СпрСклады
			|ГДЕ
			|	НЕ СпрСклады.ПометкаУдаления
			|	И СпрСклады.Ссылка В ИЕРАРХИИ (&Склад)";
		Запрос.УстановитьПараметр("Склад", Склад);
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе
		
		МассивСкладов = Новый Массив();
		МассивСкладов.Добавить(Склад);
		Возврат МассивСкладов;
		
	КонецЕсли;
	
КонецФункции

#Область Заполнение

&НаСервере
Процедура ЗаполнитьТаблицуТоварыНакладной(Накладная)
	
	Распоряжения = СписокЗаказов.ВыгрузитьЗначения();
	
	ТребуемыеТовары = Неопределено;
	Если Параметры.РеквизитыШапки.Свойство("ТребуемыеТовары") Тогда
		ТребуемыеТовары = ПолучитьИзВременногоХранилища(Параметры.РеквизитыШапки.ТребуемыеТовары);
	КонецЕсли;
	
	НастройкиОтборов = ПолучитьНастройкиОтборов(Параметры.РеквизитыШапки);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивЗаказов",          Распоряжения);
	Запрос.УстановитьПараметр("ТоварыПоЗаказам",        ?(НастройкиОтборов = Неопределено, Неопределено, НастройкиОтборов.ТаблицаОтборов));
	Запрос.УстановитьПараметр("Накладная",              Накладная);
	Запрос.УстановитьПараметр("Склад",                  Склады.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("НакладнаяНаПриемку",     НастройкиФормы.НакладнаяНаПриемку);
	Запрос.УстановитьПараметр("НакладнаяНаОтгрузку",    НастройкиФормы.НакладнаяНаОтгрузку);
	Запрос.УстановитьПараметр("ТребуемыеТовары",        ТребуемыеТовары);
	
	Запрос.УстановитьПараметр("ОсновнаяНоменклатура",   НастройкиФормы.ОсновнойТовар.Ключ.Номенклатура);
	Запрос.УстановитьПараметр("ОсновнаяХарактеристика", НастройкиФормы.ОсновнойТовар.Ключ.Характеристика);
	Запрос.УстановитьПараметр("ОсновнаяСклад",          НастройкиФормы.ОсновнойТовар.Ключ.Склад);
	Если НастройкиФормы.ЭтоДокументПоступлениеТоваров Тогда
		Запрос.УстановитьПараметр("ХозОперацииРаздельнойЗакупки", Новый Массив);
	Иначе
		Запрос.УстановитьПараметр("ХозОперацииРаздельнойЗакупки", ЗакупкиСервер.ХозяйственныеОперацииРаздельнойЗакупкиБезОтборов());
	КонецЕсли;
	
	ЕстьОтборПоСкладу        = ЗначениеЗаполнено(Склад);
	ЕстьОтборПоТоварам       = ЗначениеЗаполнено(ТребуемыеТовары);
	ЕстьОтборПоТоварамЗаказа = НастройкиОтборов <> Неопределено;
	
	Запрос.Текст = ТекстЗапросаТоваровНакладной(ЕстьОтборПоСкладу, ЕстьОтборПоТоварам, ЕстьОтборПоТоварамЗаказа);
	ТоварыНакладной.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для Каждого СтрокаТовары Из ТоварыНакладной Цикл
		СтрокаТовары.Увеличить = ?(СтрокаТовары.Расхождение > 0, 1, 0);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекстЗапросаТоваровНакладной(ЕстьОтборПоСкладу, ЕстьОтборПоТоварам, ЕстьОтборПоТоварамЗаказа)
	
	ТекстЗапросаОтборПоТоварам = ?(ЕстьОтборПоТоварам,
		"ВЫБРАТЬ
		|	ТаблицаОтбора.Номенклатура КАК Номенклатура,
		|	ТаблицаОтбора.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТТаблицаОтбора
		|ИЗ
		|	&ТребуемыеТовары КАК ТаблицаОтбора
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика
		|;
		|"
		, "");
		
	ТекстЗапросаОтборПоТоварамЗаказа = ?(ЕстьОтборПоТоварамЗаказа,
		"ВЫБРАТЬ
		|	ВтТаблицаОтборовПоТоварамЗаказа.Ссылка		   КАК Заказ,
		|	ВтТаблицаОтборовПоТоварамЗаказа.Номенклатура   КАК Номенклатура,
		|	ВтТаблицаОтборовПоТоварамЗаказа.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВтТаблицаОтборовПоТоварамЗаказа
		|ИЗ
		|	&ТоварыПоЗаказам КАК ВтТаблицаОтборовПоТоварамЗаказа
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	Номенклатура,
		|	Характеристика
		|;
		|"
		, "");
	
	ТекстЗапроса = 
		ТекстЗапросаОтборПоТоварам
		+ ТекстЗапросаОтборПоТоварамЗаказа
		+ "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.ДокументОтгрузки КАК Заказ,
		|
		|	Таблица.Номенклатура   КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Серия          КАК Серия,
		|	Таблица.Склад          КАК Склад,
		|
		|	Таблица.КОтгрузкеРасход
		|		+ Таблица.СобраноПриход
		|		- Таблица.КОформлениюРасход КАК РасхождениеПоЗаказу
		|
		|ПОМЕСТИТЬ ВтТовары
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.ОстаткиИОбороты(, , , , 
		|		&ОтборТоварыКОтгрузке
		|		) КАК Таблица
		|ГДЕ
		|	Таблица.КОтгрузкеРасход
		|		+ Таблица.СобраноПриход
		|		- Таблица.КОформлениюРасход <> 0
		|	И &НакладнаяНаОтгрузку
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.ДокументПоступления КАК Заказ,
		|
		|	Таблица.Номенклатура   КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Серия          КАК Серия,
		|	Таблица.Склад          КАК Склад,
		|
		|	Таблица.КОформлениюПоступленийПоОрдерамОстаток КАК РасхождениеПоЗаказу
		|
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки(,
		|		&ОтборТоварыКОформлениюПоступления И НЕ ХозяйственнаяОперация В (&ХозОперацииРаздельнойЗакупки)
		|		) КАК Таблица
		|ГДЕ
		|	Таблица.КОформлениюПоступленийПоОрдерамОстаток <> 0
		|	И &НакладнаяНаПриемку
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.ДокументПоступления КАК Заказ,
		|
		|	Таблица.Номенклатура   КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Серия          КАК Серия,
		|	Таблица.Склад          КАК Склад,
		|
		|	-Таблица.КОформлениюПоступленийПоНакладнымОстаток КАК РасхождениеПоЗаказу
		|
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки(,
		|		&ОтборТоварыКОформлениюПоступления И ХозяйственнаяОперация В (&ХозОперацииРаздельнойЗакупки)
		|		) КАК Таблица
		|ГДЕ
		|	Таблица.КОформлениюПоступленийПоНакладнымОстаток <> 0
		|	И &НакладнаяНаПриемку
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////
		// Расхождение по всем заказам.
		|ВЫБРАТЬ
		|	Таблица.Номенклатура   КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Серия          КАК Серия,
		|	Таблица.Склад          КАК Склад,
		|
		|	СУММА(Таблица.РасхождениеПоЗаказу) КАК Количество
		|
		|ПОМЕСТИТЬ ВтРасхождение
		|ИЗ
		|	ВтТовары КАК Таблица
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица.Номенклатура, Таблица.Характеристика, Таблица.Серия, Таблица.Склад
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Серия, Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////
		// Номенклатура накладной.
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.ДокументОтгрузки КАК Заказ,
		|
		|	Таблица.Номенклатура   КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Серия          КАК Серия,
		|	Таблица.Склад          КАК Склад,
		|
		|	СУММА(Таблица.КОформлению) КАК Количество
		|
		|ПОМЕСТИТЬ ВтНакладная
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке КАК Таблица
		|ГДЕ
		|	Таблица.Активность
		|	И Таблица.Регистратор = &Накладная
		|	И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И &НакладнаяНаОтгрузку
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица.ДокументОтгрузки,
		|	Таблица.Номенклатура, Таблица.Характеристика, Таблица.Серия, Таблица.Склад
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.ДокументПоступления КАК Заказ,
		|
		|	Таблица.Номенклатура   КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Серия          КАК Серия,
		|	Таблица.Склад          КАК Склад,
		|
		|	СУММА(Таблица.КОформлениюПоступленийПоОрдерам) КАК Количество
		|
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению КАК Таблица
		|ГДЕ
		|	Таблица.Активность
		|	И Таблица.Регистратор = &Накладная
		|	И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И &НакладнаяНаПриемку
		|	И НЕ Таблица.ХозяйственнаяОперация В (&ХозОперацииРаздельнойЗакупки)
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица.ДокументПоступления,
		|	Таблица.Номенклатура, Таблица.Характеристика, Таблица.Серия, Таблица.Склад
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.ДокументПоступления КАК Заказ,
		|
		|	Таблица.Номенклатура   КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Серия          КАК Серия,
		|	Таблица.Склад          КАК Склад,
		|
		|	СУММА(Таблица.КОформлениюПоступленийПоНакладным) КАК Количество
		|
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению КАК Таблица
		|ГДЕ
		|	Таблица.Активность
		|	И Таблица.Регистратор = &Накладная
		|	И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И &НакладнаяНаПриемку
		|	И Таблица.ХозяйственнаяОперация В (&ХозОперацииРаздельнойЗакупки)
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица.ДокументПоступления,
		|	Таблица.Номенклатура, Таблица.Характеристика, Таблица.Серия, Таблица.Склад
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Серия, Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	Таблица.Заказ          КАК Заказ,
		|
		|	ЕСТЬNULL(СпрНоменклатура.Наименование, """") КАК НоменклатураНаименование,
		|	Таблица.Характеристика.Наименование          КАК ХарактеристикаНаименование,
		|	Таблица.Склад.Наименование                   КАК СкладНаименование,
		|
		|	Таблица.Номенклатура   КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Серия          КАК Серия,
		|	Таблица.Склад          КАК Склад,
		|
		|	ТаблицаРасхождениеВсего.Количество КАК Расхождение,
		|	ТаблицаНакладная.Количество        КАК КоличествоВНакладной,
		|
		|	ВЫБОР КОГДА Таблица.РасхождениеПоЗаказу < 0 И ЕСТЬNULL(ТаблицаНакладная.Количество, 0) < -Таблица.РасхождениеПоЗаказу ТОГДА
		|				-ТаблицаНакладная.Количество
		|			ИНАЧЕ
		|				Таблица.РасхождениеПоЗаказу
		|		КОНЕЦ                          КАК УвеличитьУменьшить,
		|
		|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|
		|	// Служебные реквизиты на форму
		|	ВЫБОР КОГДА СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать) ТОГДА
		|				ЛОЖЬ
		|			ИНАЧЕ
		|				ИСТИНА
		|		КОНЕЦ                          ХарактеристикиИспользуются,
		|
		|	ВЫБОР КОГДА Таблица.Номенклатура         = &ОсновнаяНоменклатура
		|					И Таблица.Характеристика = &ОсновнаяХарактеристика
		|					И Таблица.Склад          В(&Склад) ТОГДА
		|				1
		|			ИНАЧЕ
		|				0
		|		КОНЕЦ                          ОсновнойТовар
		|
		|ИЗ
		|	ВтТовары КАК Таблица
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтНакладная КАК ТаблицаНакладная
		|		ПО Таблица.Номенклатура   = ТаблицаНакладная.Номенклатура
		|		 И Таблица.Характеристика = ТаблицаНакладная.Характеристика
		|		 И Таблица.Серия          = ТаблицаНакладная.Серия
		|		 И Таблица.Склад          = ТаблицаНакладная.Склад
		|		 И Таблица.Заказ          = ТаблицаНакладная.Заказ
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРасхождение КАК ТаблицаРасхождениеВсего
		|		ПО Таблица.Номенклатура   = ТаблицаРасхождениеВсего.Номенклатура
		|		 И Таблица.Характеристика = ТаблицаРасхождениеВсего.Характеристика
		|		 И Таблица.Серия          = ТаблицаРасхождениеВсего.Серия
		|		 И Таблица.Склад          = ТаблицаРасхождениеВсего.Склад
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО СпрНоменклатура.Ссылка = Таблица.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураНаименование, ХарактеристикаНаименование, СкладНаименование,
		|	Заказ";
		
	Если ЕстьОтборПоТоварамЗаказа Тогда
		
		ОтборТоварыКОтгрузке         = "(ДокументОтгрузки, Номенклатура, Характеристика) В
									   |			(ВЫБРАТЬ
									   |				ВтТаблицаОтборовПоТоварамЗаказа.Заказ,
									   |				ВтТаблицаОтборовПоТоварамЗаказа.Номенклатура,
									   |				ВтТаблицаОтборовПоТоварамЗаказа.Характеристика
									   |			ИЗ
									   |				ВтТаблицаОтборовПоТоварамЗаказа)";
		
		ТоварыКОформлениюПоступления = "(ДокументПоступления, Номенклатура, Характеристика) В
									   |			(ВЫБРАТЬ
									   |				ВтТаблицаОтборовПоТоварамЗаказа.Заказ,
									   |				ВтТаблицаОтборовПоТоварамЗаказа.Номенклатура,
									   |				ВтТаблицаОтборовПоТоварамЗаказа.Характеристика
									   |			ИЗ
									   |				ВтТаблицаОтборовПоТоварамЗаказа)";
		
	Иначе
		ОтборТоварыКОтгрузке         = "ДокументОтгрузки В (&МассивЗаказов)";
		ТоварыКОформлениюПоступления = "ДокументПоступления В (&МассивЗаказов)";
	КонецЕсли;	
	
	Если ЕстьОтборПоСкладу Тогда
		ОтборТоварыКОтгрузке         = "Склад В (&Склад) И " + ОтборТоварыКОтгрузке;
		ТоварыКОформлениюПоступления = "Склад В (&Склад) И " + ТоварыКОформлениюПоступления;
	КонецЕсли;	
	
	Если ЕстьОтборПоТоварам Тогда
		ОтборПоТоварам = 
		"(Номенклатура, Характеристика) В
		|	(ВЫБРАТЬ
		|		ТаблицаОтбора.Номенклатура,
		|			ТаблицаОтбора.Характеристика
		|		ИЗ
		|			ВТТаблицаОтбора КАК ТаблицаОтбора)";
		
		ОтборТоварыКОтгрузке = ОтборТоварыКОтгрузке + " И " + ОтборПоТоварам;
		ТоварыКОформлениюПоступления = ТоварыКОформлениюПоступления + " И " + ОтборПоТоварам;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборТоварыКОтгрузке", ОтборТоварыКОтгрузке);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборТоварыКОформлениюПоступления", ТоварыКОформлениюПоступления);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Положительная общая разница
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Положительная общая разница'");
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Расхождение.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТоварыНакладной.Расхождение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи);
	
	// Отрицательная общая разница
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Отрицательная общая разница'");
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Расхождение.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТоварыНакладной.Расхождение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ОтметкаОтрицательногоВыполненияЗадачи);
	
	// Положительная разница
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Положительная разница'");
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.УвеличитьУменьшить.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТоварыНакладной.УвеличитьУменьшить");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи);
	
	// Отрицательная разница
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Отрицательная разница'");
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.УвеличитьУменьшить.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТоварыНакладной.УвеличитьУменьшить");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ОтметкаОтрицательногоВыполненияЗадачи);
	
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
		ЭтаФорма, "Характеристика", "ТоварыНакладной.ХарактеристикиИспользуются");
		
	
КонецПроцедуры

&НаСервере
Функция НакладныеПоЗаказам(Заказы)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Таблица.Регистратор      КАК Накладная,
	|	РеквизитыДокумента.ДатаДокументаИБ КАК Дата
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеквизитыДокумента
	|		ПО РеквизитыДокумента.Ссылка = Таблица.Регистратор
	|		И НЕ РеквизитыДокумента.ДополнительнаяЗапись
	|ГДЕ
	|	Таблица.Активность
	|	//ОтборПоЗаказам_И Таблица.ДокументОтгрузки В(&Заказы)
	|	//ОтборПоТоварам_И (Таблица.ДокументОтгрузки, Таблица.Номенклатура, Таблица.Характеристика) В
	|	//ОтборПоТоварам_		(ВЫБРАТЬ
	|	//ОтборПоТоварам_			ВтТаблицаОтборовПоТоварамЗаказа.Заказ,
	|	//ОтборПоТоварам_			ВтТаблицаОтборовПоТоварамЗаказа.Номенклатура,
	|	//ОтборПоТоварам_			ВтТаблицаОтборовПоТоварамЗаказа.Характеристика
	|	//ОтборПоТоварам_		ИЗ
	|	//ОтборПоТоварам_			ВтТаблицаОтборовПоТоварамЗаказа)
	|	И ВЫБОР КОГДА &СкладЗаполнен ТОГДА Таблица.Склад В(&Склад) ИНАЧЕ ИСТИНА КОНЕЦ
	|	И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Таблица.КОформлению > 0
	|	И Таблица.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И &НакладнаяНаОтгрузку
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Регистратор      КАК Накладная,
	|	РеквизитыДокумента.ДатаДокументаИБ КАК Дата
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеквизитыДокумента
	|		ПО РеквизитыДокумента.Ссылка = Таблица.Регистратор
	|		И НЕ РеквизитыДокумента.ДополнительнаяЗапись
	|ГДЕ
	|	Таблица.Активность
	|	//ОтборПоЗаказам_И Таблица.ДокументПоступления В(&Заказы)
	|	//ОтборПоТоварам_И (Таблица.ДокументПоступления, Таблица.Номенклатура, Таблица.Характеристика) В
	|	//ОтборПоТоварам_		(ВЫБРАТЬ
	|	//ОтборПоТоварам_			ВтТаблицаОтборовПоТоварамЗаказа.Заказ,
	|	//ОтборПоТоварам_			ВтТаблицаОтборовПоТоварамЗаказа.Номенклатура,
	|	//ОтборПоТоварам_			ВтТаблицаОтборовПоТоварамЗаказа.Характеристика
	|	//ОтборПоТоварам_		ИЗ
	|	//ОтборПоТоварам_			ВтТаблицаОтборовПоТоварамЗаказа)
	|	И ВЫБОР КОГДА &СкладЗаполнен ТОГДА Таблица.Склад В(&Склад) ИНАЧЕ ИСТИНА КОНЕЦ
	|	И ВЫБОР КОГДА &ХозОперацияЗаполнена ТОГДА
	|		РеквизитыДокумента.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|	ИНАЧЕ
	|		ИСТИНА
	|	КОНЕЦ
	|	И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Таблица.КОформлениюПоступленийПоОрдерам > 0
	|	И (&ДатаНачала = Неопределено ИЛИ Таблица.Период МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|	И &НакладнаяНаПриемку
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Регистратор КАК Накладная,
	|	ЕСТЬNULL(РеквизитыДокумента.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)) КАК Дата
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеквизитыДокумента
	|		ПО РеквизитыДокумента.Ссылка = Таблица.Регистратор
	|		И НЕ РеквизитыДокумента.ДополнительнаяЗапись
	|ГДЕ
	|	Таблица.Активность
	|	//ОтборПоЗаказам_И Таблица.ДокументПоступления В(&Заказы)
	|	//ОтборПоТоварам_И (Таблица.ДокументПоступления, Таблица.Номенклатура, Таблица.Характеристика) В
	|	//ОтборПоТоварам_		(ВЫБРАТЬ
	|	//ОтборПоТоварам_			ВтТаблицаОтборовПоТоварамЗаказа.Заказ,
	|	//ОтборПоТоварам_			ВтТаблицаОтборовПоТоварамЗаказа.Номенклатура,
	|	//ОтборПоТоварам_			ВтТаблицаОтборовПоТоварамЗаказа.Характеристика
	|	//ОтборПоТоварам_		ИЗ
	|	//ОтборПоТоварам_			ВтТаблицаОтборовПоТоварамЗаказа)
	|	И ВЫБОР КОГДА &СкладЗаполнен ТОГДА Таблица.Склад В(&Склад) ИНАЧЕ ИСТИНА КОНЕЦ
	|	И ВЫБОР КОГДА &ХозОперацияЗаполнена ТОГДА
	|		РеквизитыДокумента.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|	ИНАЧЕ
	|		ИСТИНА
	|	КОНЕЦ
	|	И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Таблица.КОформлениюПоступленийПоНакладным > 0
	|	И (&ДатаНачала = Неопределено ИЛИ Таблица.Период МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|	И &НакладнаяНаПриемку
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|";
	
	НастройкиОтборов      = ПолучитьНастройкиОтборов(Параметры.РеквизитыШапки);
	Если НастройкиОтборов = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ОтборПоЗаказам_", "");
	Иначе	
		
		ТекстЗапросаОтборПоТоварам =
		"ВЫБРАТЬ
		|	ВтТаблицаОтборовПоТоварамЗаказа.Ссылка		   КАК Заказ,
		|	ВтТаблицаОтборовПоТоварамЗаказа.Номенклатура   КАК Номенклатура,
		|	ВтТаблицаОтборовПоТоварамЗаказа.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВтТаблицаОтборовПоТоварамЗаказа
		|ИЗ
		|	&Заказы КАК ВтТаблицаОтборовПоТоварамЗаказа
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	Номенклатура,
		|	Характеристика
		|";
		
		ТекстыЗапросов = Новый Массив;
		ТекстыЗапросов.Добавить(ТекстЗапросаОтборПоТоварам);
		ТекстыЗапросов.Добавить(СтрЗаменить(ТекстЗапроса, "//ОтборПоТоварам_", ""));
		
		ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Заказы", ?(НастройкиОтборов = Неопределено, Заказы, НастройкиОтборов.ТаблицаОтборов));
	Запрос.УстановитьПараметр("Склад", Склады.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("СкладЗаполнен", ЗначениеЗаполнено(Склад));
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Запрос.УстановитьПараметр("ХозОперацияЗаполнена", ЗначениеЗаполнено(ХозяйственнаяОперация));
	Запрос.УстановитьПараметр("ДатаНачала", ?(ЗначениеЗаполнено(СтандартныйПериод.ДатаНачала),СтандартныйПериод.ДатаНачала,Неопределено));
	Запрос.УстановитьПараметр("ДатаОкончания", ?(ЗначениеЗаполнено(СтандартныйПериод.ДатаОкончания),СтандартныйПериод.ДатаОкончания,Дата(3999,12,31)));
	Запрос.УстановитьПараметр("НакладнаяНаПриемку", НастройкиФормы.НакладнаяНаПриемку);
	Запрос.УстановитьПараметр("НакладнаяНаОтгрузку", НастройкиФормы.НакладнаяНаОтгрузку);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицуТоварыНакладнойОтложенно()
	
	ТоварыНакладной.Очистить();
	СтрокаТовары = Элементы.ОформленныеНакладные.ТекущиеДанные;
	Если СтрокаТовары <> Неопределено Тогда
		
		ЗаполнитьТаблицуТоварыНакладной(СтрокаТовары.Накладная);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура СтандартныйПериодПриИзмененииСервер()
	ТаблицаНакладных = НакладныеПоЗаказам(СписокЗаказов);
	ОформленныеНакладные.Загрузить(ТаблицаНакладных);
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиОтборов(ПараметрыОтборов) 

	ТаблицаОтборов = Новый ТаблицаЗначений;

	//++ НЕ УТ

	ОтборПоТоварам = Неопределено;
	ПараметрыОтборов.Свойство("ОтборПоТоварам", ОтборПоТоварам);

	Если ЗначениеЗаполнено(ОтборПоТоварам) Тогда

		ТаблицаОтборов.Колонки.Добавить("Ссылка",
			Документы.ТипВсеСсылки());
		
		ТаблицаОтборов.Колонки.Добавить("Номенклатура",
			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));

		ТаблицаОтборов.Колонки.Добавить("Характеристика",
			Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));

		Для каждого ЭлементОтбора Из ОтборПоТоварам Цикл

			ДокументИсточник = ЭлементОтбора.Ключ;

			ЗначенияОтбора = ЭлементОтбора.Значение;
			Для каждого ЗначениеОтбора Из ЗначенияОтбора Цикл

				СтрокаТаблицыОтбора = ТаблицаОтборов.Добавить();
				СтрокаТаблицыОтбора.Ссылка = ДокументИсточник;
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыОтбора, ЗначениеОтбора.Значение);

			КонецЦикла;

		КонецЦикла;

	КонецЕсли;

	//-- НЕ УТ

	НастройкаОтборов = ?(ТаблицаОтборов.Колонки.Количество() = 0,
		Неопределено, Новый Структура("ТаблицаОтборов", ТаблицаОтборов));

	Возврат НастройкаОтборов;

КонецФункции

#КонецОбласти
